cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

brew 'ack'
brew 'awscli'
brew 'fswatch'
brew 'gettext'
brew 'git'
brew 'go'
brew 'imagemagick'
brew 'mas'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'tmux'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'yarn'

# Development
brew 'php71', args: ['with-debug']
brew 'php71-intl'
brew 'mariadb'

#cask 'mapbox-studio'
cask 'alfred'
cask 'arq'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'keepassx'
cask 'poedit'
cask 'postman'
cask 'rescuetime'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'tunnelbear'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install App Store apps
mas 'aText', id: 488566438
mas 'Bear', id: 1091189122
mas 'CloudApp', id: 417602904
mas 'Harvest', id: 506189836
mas 'Keka', id: 470158793
mas 'Todoist', id: 585829637
