cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

brew 'awscli'
brew 'coreutils' # Install GNU core utilities (those that come with macOS are outdated)
brew 'findutils' # Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'ffmpeg'
brew 'fswatch'
brew 'gettext'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mas'
brew 'openssl'
brew 'stripe/stripe-cli/stripe'
brew 'trash'
brew 'unrar'
brew 'wget'
brew 'zlib' # Needed for Memcached

# Media
brew 'jpegoptim'
brew 'pngquant'
brew 'svgo'

# Development
brew 'brew-php-switcher'
brew 'php'
brew 'php@7.3', args: ['with-debug']
brew 'php@7.4'
brew 'composer'
brew 'go'
brew 'heroku'
brew 'imagemagick'
brew 'libmemcached'
brew 'mariadb'
brew 'memcached'
brew 'phpunit'
brew 'python'
brew 'python3'
brew 'redis'
brew 'ruby'
brew 'ruby-build'
brew 'tmux'
brew 'vim', args: ['--override-system-vi']
brew 'yarn'

# Apps
cask 'alfred'
cask 'appcleaner'
cask 'arq'
cask 'avira-antivirus'
cask 'brave-browser'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'google-drive'
cask 'iterm2'
cask 'insomnia'
cask 'joplin'
cask 'keepassxc'
cask 'phpstorm'
cask 'poedit'
cask 'slack'
cask 'sketch'
cask 'sublime-text'
cask 'tableplus'
cask 'zoom'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install App Store apps
mas 'aText', id: 488566438
mas 'Bear', id: 1091189122
mas 'Harvest', id: 506189836
mas 'Keka', id: 470158793
mas 'Todoist', id: 585829637
