cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'heroku/brew'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

brew 'awscli'
brew 'composer'
brew 'fswatch'
brew 'gettext'
brew 'git'
brew 'go'
brew 'heroku'
brew 'imagemagick'
brew 'mariadb'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'pngcrush'
brew 'brew-php-switcher'
brew 'php@7.3', args: ['with-debug']
brew 'php@7.4'
brew 'phpunit'
brew 'readline'
brew 'ruby'
brew 'ruby-build'
brew 'tmux'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'yarn'
brew 'jq'

# Development
cask 'alfred'
cask 'arq'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'google-drive'
cask 'iterm2'
cask 'keepassxc'
cask 'poedit'
cask 'slack'
cask 'sublime-text'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install App Store apps
mas 'aText', id: 488566438
mas 'Bear', id: 1091189122
mas 'CloudApp', id: 417602904
mas 'Harvest', id: 506189836
mas 'Keka', id: 470158793
mas 'Todoist', id: 585829637
